### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [10]:
data=[4,8,15,16,23,42]
import pandas as pd

In [14]:
pd.Series(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [15]:
l2=[1,2,3,4,5,6,7,8,9,10]

In [16]:
pd.Series(l2)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

### Q3. Create a Pandas DataFrame that contains the following data: Then, print the DataFrame.

In [20]:
import csv

In [25]:
l3=[ ["Name","Age","Gender"],
     ["Alice",25,"Female"],
     ["Bob",30,"Male"],
     ["Charlie",27,"Male"] ]

In [36]:
with open("data.csv","w") as p1:
    w=csv.writer(p1)
    for i in l3:
        w.writerow(i)

In [37]:
pd.read_csv("data.csv")

      Name  Age  Gender
0    Alice   25  Female
1      Bob   30    Male
2  Charlie   27    Male

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Data frame is a labelled structural data in rows and column like a spreadsheet where series is like a list which has index and can be accesed in column.

In [38]:
pd.read_csv("data.csv")

      Name  Age  Gender
0    Alice   25  Female
1      Bob   30    Male
2  Charlie   27    Male

In [39]:
type(pd.read_csv("data.csv"))#Dataframe

pandas.core.frame.DataFrame

In [40]:
df=pd.read_csv("data.csv")

In [44]:
df["Name"]

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object

In [46]:
type(df["Name"])#Series

pandas.core.series.Series

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Some functions are head() ,tail(),columns etc

In [49]:
df.head(1)#find data from top.

    Name  Age  Gender
0  Alice   25  Female

In [50]:
df.tail(1)#find data from bottom.

      Name  Age Gender
2  Charlie   27   Male

In [52]:
df.columns#Gives all index name of rows.

Index(['Name', 'Age', 'Gender'], dtype='object')

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

* Series:A seies is mutable as we can change values of the datas.
* DataFrame:A Dataframe is also mutable as we can also change its value.
* Panel:It was present in older version of pandas which was immutable.

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [60]:
name=pd.Series(["Alice","Bob","Charlie"])
age=pd.Series([25,30,27])
gender=pd.Series(["Male","Female","Male"])
data={
'Name':name,
'Age':age,
'Gender':gender}
p=pd.DataFrame(data)
print(p)

      Name  Age  Gender
0    Alice   25    Male
1      Bob   30  Female
2  Charlie   27    Male

In [61]:
type(p)

pandas.core.frame.DataFrame